Revit 2027 API
FabricationPartSizeMap.AllowMultipleServiceSizes Property
 State flag to allow multiple services to include the same size.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AllowMultipleServiceSizes { get; set; }
Public Property AllowMultipleServiceSizes As Boolean
	Get
	Set
public:
property bool AllowMultipleServiceSizes {
	bool get ();
	void set (bool value);
}
member AllowMultipleServiceSizes : bool with get, set
Property Value
Boolean
See Also
Reference
FabricationPartSizeMap Class
Autodesk.Revit.DB.Fabrication Namespace